{"title":"French police investigate reports of decorated officer filmed punching protesters","author":"By Bianca Britton and Saskya Vandoorne, CNN","content":"A video widely circulated on social media appears to show policeman Didier Andrieux, who was awarded the Legion of Honor -- the country's highest accolade -- approaching a protester standing against a wall before punching him repeatedly. In the video, allegedly filmed in Toulon on Saturday, the police officer then approached other Gilets Jaunes protesters and punched them.\nA spokeswoman for the national police told CNN that Andrieux had been sanctioned in the past for \"violent behavior\" and that an investigation has been opened into his actions.\nThe prefect of Var, the region where the alleged attack took place, tweeted that he has asked for an investigation. \"As part of my administrative responsibilities, I have asked the IGPN (Inspection Générale de la Police Nationale) for an investigation to shed light on the suspicion of police violence in #Toulon,\" tweeted Jean-Luc Videlaine.\nMeanwhile, a separate video went viral after another man was caught on camera throwing punches at French riot police on Saturday in Paris. He was later identified as a former professional boxer. \nWearing all black, the man jumped over a barrier and repeatedly punched officers as they shielded themselves.\nInterior Minister Christophe Castaner tweeted Monday that \"the individual who violently attacked the policemen on the Senghor footbridge on Saturday has turned himself in to Paris investigators.\"\nCastaner described the attack \"cowardly and intolerable\" and praised the police for staying calm.\nOn Monday the boxer identified himself as Christophe Dettinger in a video posted on Facebook and said he was defending himself.\n\"I was the person who faced the riot police on Saturday, January 5. I wanted to explain things my way,\" he said.\n\"I love my country and I am patriotic. But, after being hit again and again, I was also gassed on the last day,\" Dettinger added. \"Yes, the anger started building and I reacted badly. But I defended myself.\"\nThe French Boxing Federation called the behavior \"unacceptable and shameful.\"\nThe Federation, as well as the National Professional Boxing League, \"strongly condemns such acts of extreme violence that are totally contrary to the values ​​advocated by our discipline,\" the federation said in a statement.\nGilets jaunes\nUnrest erupted across France on Saturday in the latest Gilets Jaunes, or \"yellow vest,\" protests.  Around 50,000 people demonstrated, Castaner said. Large gatherings were held in Paris, Bordeaux and Marseilles.\nThe protests are named after the yellow high-visibility jackets French motorists must carry in their vehicles.\nThey have morphed from dissent over rising gas prices and eco-taxes into a broader demonstration against President Emmanuel Macron and his government, and tensions between the metropolitan elite and rural poor.\nIn December, Macron pledged to increase the minimum wage and get rid of new pension taxes, a move that didn't appease the anger of some of the protesters."}