{"title":"Polyana Viana: Why you should never pick on a UFC fighter","author":"","content":"As a man in Rio de Janiero has discovered to his cost after he approached UFC athlete Polyana Viana while she was waiting for an Uber outside her home in the Brazilian city on Saturday.\nVisit CNN.com/Sport for more news, features and videos \n\"He asked me the time, I said it, and I saw he wasn't going to leave,\" 26-year-old Viana told MMAJunkie. \n\"And then he said, 'Give me the phone. Don't try to react, because I'm armed.' Then he put his hand over [a gun], but I realized it was too soft.\"\nREAD: Mayweather pummels kickboxing opponent Nasukawa in first round TKO\nSuspicious that the gun was fake, Viana decided to take matters into her own hands.\n\"I threw two punches and a kick. He fell, then I caught him in a rear-naked choke. Then I sat him down in the same place we were before,\" said Viana, who is currently unbooked but has a 1-1 record in the Octagon.\nThe Brazilian fighter continued to subdue the man until police arrived to take him away. It transpired the \"firearm\" was simply a cardboard cutout. \nThe Rio police department told CNN Sport that an incident had occurred in the same area of the city, and an arrest was made, but they would not name the alleged mugger. \n\"A criminal was found immobilized by civilians after trying to rob a person on site,\" a statement read. \"A fake gun was seized with him.\"\nMMAJunkie posted a photo of the alleged cardboard gun, they reported receiving from Viana.  \nViana said she felt \"fine\" after the incident, suggesting the man seemed most affected by the ordeal. She later said the culprit was treated for his injuries before being taken to the police station, where she filed a report. \nPictures from the alleged incident, reportedly taken by Viana, appeared on UFC president Dana White's Instagram account showing the man's gruesome injuries.\n\"On the left is @polyanaviana, one of our @UFC fighters and on the right is the guy who tried to rob her,\" wrote White, who added: \"#Badf***ingidea\"\nViana responded: \"The boss @danawhite posted another one of my cheeky pics ... I am so thinking I am all that!\"\nCNN Sport has reached out to the UFC for comment from Viana but she was unavailable for an immediate response. "}