{"title":"Lindsey Vonn fit to resume skiing record quest","author":"By Rob Hodgetts, CNN","content":"The 34-year-old hurt her knee in a training crash at Copper Mountain, Colorado in November and has spent the intervening weeks in rehab as compatriot Mikaela Shiffrin has stolen the limelight with a string of victories  in skiing's technical disciplines.\nREAD: Is Mikaela Shiffrin the most dominant athlete on the planet? \nBut speed queen Vonn announced her comeback in a video posted on Instagram, and will resume her quest to pass Swedish great Ingemar Stenmark's record of 86 World Cup victories. \n\"I'm NOT done yet!!! It's been a tough 6 weeks but I'm on skis again and excited to get back in the starting gate. See you in St. Anton this weekend,\" she wrote on the post.\nThe American needs five wins to pass Stenmark in what she has said will be her final full season.\n\"Physically, I've gotten to the point where it doesn't make sense. I really would like to be active when I'm older,\" the injury-hit Vonn told NBC in October.\nShe also intends to race in Lake Louise, Canada, at the start of the next season after missing the event at her favorite venue in December.\nVonn is already the most successful female World Cup ski racer of all time. One more victory would also make her the oldest winner of a World Cup race, passing Austrian Elisabeth Goergl, who was 33 years and 301 days old when she won her last race in 2014.\nVisit CNN.com/Sport for more news, features and videos \n'Nothing left to prove'\nAt the Winter Games in South Korea in February Vonn became the oldest woman -- at 33 -- to win a medal in any of the five Olympic skiing disciplines when she took bronze in the downhill.\nSince winning gold in Vancouver in 2010, her only Olympic title, the four-time World Cup overall winner has suffered multiple injuries -- fractures, knee ligament tears, concussion -- and undergone surgery a host of times.\nIt was a knee injury which prevented her from defending her downhill title in Sochi in 2014.\nREAD: How getting fit to ski can unlock 'sixth sense'\nBeating Stenmark's record \"would be a dream come true,\" she told NBC, but Vonn is adamant this will be her last season either way.\n\"I have nothing left to prove to myself or anyone else,\" she said.\nHowever, Vonn has long yearned to be allowed to compete in a men's race and told Sports Illustrated last year she was \"going to work hard\" to make it possible.\nSt. Anton hosts a downhill Saturday and a super-G Sunday before the women's speed circuit moves to Cortina d'Ampezzo in Italy."}