{"title":"Marcel Hirscher back to winning ways in Zagreb ","author":"By Rob Hodgetts, CNN","content":"The Austrian superstar won his sixth World Cup race of the season under the floodlights in Zagreb Sunday to push his overall tally to 64 victories on the circuit.\nHirscher beat France's Alexis Pinturault in the two-run slalom in Croatia for the 30th slalom win of his career as he chases an unprecedented eighth World Cup overall title\nThe 29-year-old was beaten by Britain's Dave Ryding in the heats of the Oslo parallel slalom last week and could only manage 26th in Italy before Christmas but his Zagreb victory puts him back on track.    \n\"The last two races not scoring any points it's making me nervous after all these years so I'm super happy I made it to the finish line today,\" he told reporters.\nREAD: Is Mikaela Shiffrin the most dominant athlete on the planet?\nHirscher has won the last seven overall crowns -- awarded to the skier with the most points across all six disciplines -- to pass the record of five set by Luxembourg's Marc Girardelli in 1993.\nHe sits second on the men's all-time list of wins behind Sweden's Ingemar Stenmark, whose record of 86 is a target for Lindsey Vonn this season.\nStenmark won 40 slalom races and a record eight World Cup slalom titles, although he only clinched three overall crowns in his career, which ended in 1989.\nColorful former Italian racer Alberto Tomba is second on the list of slalom wins with 35 five clear of Hirscher.\nREAD: How getting fit to ski can help you discover 'sixth sense'\nREAD: How Special Forces training is speeding up US downhillers\nHowever, Hirscher, the double Olympic gold medalist from PyeongChang 2018, has won five of the last six World Cup slalom titles and five of the last seven giant slalom season-ending crowns.\nHaving got married last June, and with the birth of the couple's first child in October, Hirscher admits ski racing is \"not the most important thing\" in his life anymore, and has hinted at retirement in a year or so.\n\"It is hard keep this pace, to improve yourself every year,\" he added. \"It's not just skiing, technique is changing, material is changing, the young generation is pushing even harder, I'm getting older so every year it's a little bit harder to keep this pace up.\"\nVisit CNN.com/Sport for more news, features and videos\nHirscher will be looking to defend his slalom and giant slalom titles when the biennial World Championships take place in Are, Sweden in February. \nShiffrin is targeting a fourth straight slalom world title next month."}