{"title":"Man confesses to cyberattack on German politicians","author":"By Jack Guy, Nadine Schmidt and Lauren Said-Moorhouse, CNN","content":"Hundreds of politicians and public figures were among those affected by the attack, with personal data and documents released online.\n\"During questioning, the defendant stated that he had acted alone in the data spying and unauthorized data releases,\" Ungefuk said.\nThe suspect was arrested in the German state of Hesse on Sunday as part of a joint investigation by Frankfurt's Attorney General, the Central Office for the Suppression of Cybercrime (ZIT) and the Federal Criminal Investigation Office.\n''The investigations have so far revealed no evidence of any third-party involvement,\" reads a statement from Germany's federal crime office (BKA) released on Tuesday. \n\"On his motivation, the defendant stated that he acted out of annoyance at public statements made by the politicians, journalists and public figures concerned.\" \nThe man was released on Monday evening due to a lack of grounds for detention, according to the statement, but evidence such as computers is still being evaluated.\nIn response to the data breach, Germany's interior minister Horst Seehofer told reporters that he would work to put safer measures in place to protect data in future, including a new IT security law. \nA draft bill could be presented to cabinet within a few months, Seehofer said during a press conference, but the exact timings are still to be confirmed. \nSeehofer reiterated that challenges would remain despite this new law.\n''We cannot promise absolute, total security, especially in the field of cyber security,\" he said.\nDetails of the data breach were provided by government spokeswoman Martina Fietz on Friday.\nFietz told reporters that German lawmakers at all levels, including from the European parliament, German parliament, and local politicians, had been affected. \nThe data included credit card details, phone numbers and email addresses, one political party told CNN. \nSeveral German media outlets reported that German Chancellor Angela Merkel was affected by the breach, but Fietz said no sensitive information from Merkel's office had been published.\nThis is not the first time German politicians have been targeted.\nA cyberattack targeted parts of the German government network, including the foreign ministry, early last year, Reuters reported. \nAnd in 2015, pro-Russian hackers claimed responsibility for a series of cyberattacks that brought down government websites.\nOn Friday, Fietz told reporters that it was \"too early at this stage to compare this incident to that in previous years.\""}