{"title":"Far-right German politician is beaten unconscious by masked men","author":"Tara John, CNN","content":"Frank Magnitz, a member of parliament and the leader of the anti-immigration Alternative for Germany party (AfD) in Bremen, was assaulted on Monday afternoon as he walked through the center of the city. \nMasked men knocked him unconscious with a piece of wood \"and kicked him further\" in the head as he lay on the ground, AfD wrote in a statement. \nA graphic image of the 66-year-old lying unconscious in a hospital bed was released by the party. It showed a large gash on his forehead, and his face was swollen and covered in blood. \nBremen police, who have begun an investigation into the assault, said two craftsmen called an ambulance after discovering Magnitz lying on the ground. \nIn an earlier statement, the police said that \"due to the function of the aggrieved party, a political motivation of the act can be assumed.\" \n'Fight hate with hate, you allow hate to prevail'\nAfD leader Alexander Gauland told a press conference Tuesday that Magnitz is now conscious and is expected to make a full recovery.\nThe party called Monday's attack a \"black day for democracy\" and voices across the political spectrum condemned the attack on Magnitz. \nSteffen Seibert, the chief spokesman for German Chancellor Angela Merkel, said he hopes the police will \"apprehend the perpetrators\" quickly. \nCem Ozdemir, a lawmaker for the Greens, wrote on Twitter that \"there is no justification for violence even against the AfD... if you fight hate with hate, you allow hate to prevail.\"\n\"Violence must never be a means of political confrontation -- regardless of who or what the motives are for it. There is no justification for this,\" Foreign Minister Heiko Maas, from the SPD party, wrote on Twitter.  \nThis attack comes after an explosion targeted an AfD office in the eastern state of Saxony on January 3. Police said there has been a rise in attacks against the party, and that most incidents were acts of vandalism, Reuters reports.\nAnti-immigration and anti-Islam platform\nThe AfD, which was only set up around five years ago, become the first far-right party to enter the Bundestag since 1961. It ran on an anti-immigration and anti-Islam platform, winning almost 13% of the vote in the 2017 federal elections. \nThe party says that Islam contradicts German's constitution and insists that the country should accept only migrants with high technical skills.\nAfD has taken controversial positions on key issues in the past -- like several other right-wing, populist parties across Europe. In 2017, prominent AfD politician Beatrix von Storch dismissed current debates around gender identity and LGBT rights as \"foolish nonsense.\"\nThe arrival of some 1.4 million refugees in Germany during the European migrant crisis has energized the political right, and the number of xenophobic attacks has increased.\nDuring the height of the migrant crisis, German officials said hundreds of asylum seekers and refugees were injured in more than 3,500 attacks on them and their shelters in the country in 2016. This was a substantial increase in attacks from the previous year.\nLatest statistics also show that the number of anti-Semitic crimes in Germany rose by 2.5% in 2017, which added to fears of growing hostility in the country, Reuters reported.  \nAnd last year, AfD marched with other far-right groups as thousands of people took to the streets of Chemnitz to protest against migrants. \nThe protests saw some call for the return of Nazism and for foreigners to leave Germany. It was the biggest display of far-right sentiment in the country for many years and triggered a national debate."}