{"title":"A deputy mayor trashed a homeless man's blankets, and citizens are outraged","author":"By Gianluca Mezzofiore, CNN","content":"Paolo Polidori, a member of Interior Minister Matteo Salvini's League party, wrote in a January 4 Facebook post -- that has since been deleted -- that he collected a \"mass of rags\" from the city's central Via Carducci and threw them \"with satisfaction\" into a dumpster. \n\"Now the place is decent! Will it last? We'll see. The signal is: zero tolerance!!,\" he continued.\nWhile Polidori has since defended his actions, they prompted Trieste residents to leave warm clothing and bedding in the same spot, along with a sign reading: \"Dear friend, we hope that tonight you will suffer less from the cold. We apologize on behalf of the city of Trieste.\" \nA cold snap is currently hitting the city and much of Italy with snowstorms, Arctic air and temperatures below freezing.\nAccording to local newspaper Il Piccolo, the rough sleeper in question is a 57-year-old Romanian named Mesej Mihaj who arrived in the city last October. \nIl Piccolo's Diego D'Amelio, who first tweeted a photo of the sign, told CNN the gesture was made by local people \"with a social conscience ... who were outraged by Polidori's act.\"\n\"As a reporter, I'm supposed to be neutral but this isn't like anything I've seen,\" he said. \"It shows an insane barbarism and general insensitivity. It's incredible and disturbing.\"\nPolidori later told Dire news agency that he didn't know whom the clothes belonged to: \n\"I don't know who those things belong to, they were rags, I hope they were not contaminated because I took them bare-handed. Then washed my hands ... I said to myself 'I'll do it immediately' because I don't want to see that dirt in the middle of the city.\"\nHe added that \"we can't accept such decay in Trieste.\"\nPolidori did not immediately respond to CNN's request for comment. \nThe League party has long taken a tough stance on immigration. Salvini closed the country's ports to migrant boats in June and the populist government has passed new anti-immigrant laws."}