{"title":"Saudi e-Prix: Portugal's Da Costa wins Formula E season-opener","author":"","content":"The street circuit at Ad Diriyah near Riyadh saw the debut of the much-vaunted Gen2 car and a unpredictable race with the outcome in doubt until the final turn of the 33 laps.\nDa Costa, who had claimed pole for the BMW Andretti team, held off Techeetah's Vergne to take the checkered flag by a whisker with Jerome D'Ambrosio in third for Mahindra Racing.\nFrenchman Vergne looked set to continue his dominance of the previous season in his updated car, but was given a drive through penalty for a re-charging infringement while in the lead.\nDa Costa reclaimed the advantage but a later safety car saw the pack close up from a restart and gave the opportunity for Vergne to carve his way back through the field from fourth.\nREAD: \"Welcome to Gotham\" -- Formula E unveils next generation 'Batmobile' design\nOnly da Costa stood in his way, but he ran out of road to complete the task to the obvious relief of the 27-year-old winner, who broke a three-year victory drought after working hard in pre-season testing.\n'It's amazing, it's been a really tough couple of months,\" he said.\n\"But I think we have work to do as these Techeetah cars are so fast,\" he added.\nVergne's teammate Andre Lotterer was running third when he was hit by a similar infringement penalty, but was also closing fast in fifth behind New Zealand's Mitch Evans (Jaguar Racing) by the finish.\nWATCH: Mitch Evans goes ice driving in northern Sweden\n\"I think the car we have is incredibly fast,\" said Vergne.\nFormer F1 ace Felipe Massa made some trademark overtaking moves on his Formula E debut for Venturi, but was also hit by a drive through penalty and was relegated to 14th.\nBelgium's Stoffel Vandoorne, dropped by F1 McLaren after a disappointing recent campaign, finished a lowly 17th for HWA  on his Formula E debut.\nVisit CNN.com/motorsport for more news and features\nThe next round of the 12-race enlarged series takes place in Marrakesh, Morocco next month."}