{"title":"Mohamed Salah wins Africa player of the year award for second year in a row","author":"By Aanu Adeoye, for CNN","content":"The annual award is decided by a voting panel made up of national team coaches and captains, plus a selection of officials and journalists.\nThe Liverpool striker won the Golden Boot for the 2017-18 Premier League season after scoring 32 goals in 36 appearances for the club to set a record for most goals scored by a player in the modern league era.\n\"I can't believe it's been a year since I was last on this stage. I've always said this award for me is very big. I love it, because I saw it when I was young. I had the dream to win one day. So now I've won it twice. I'm very proud to have won it twice,\" Salah said at the ceremony held in Dakar, the Senegalese capital.\n \"I have to thank my family, teammates, fans and everyone who played a role in my career to make this happen today. I would love to dedicate this award to my country, Egypt.\" \nSalah is the second Egyptian to win the award after Mahmoud Al Khatib's 1983 success.\nThe 26-year-old Salah, alongside Mane, also led his Liverpool side to the Champions League final in 2018, where they lost to Spanish giants Real Madrid in Kiev, Ukraine, in a game in which he went off in the first half after suffering a shoulder injury.\nThe Egyptian international, however, endured a torrid time during the 2018 World Cup in Russia with his national side.\nHe scored twice for Egypt but that could not stop the team from crashing out in the group stages with three consecutive defeats.\nREAD: Mo Salah: Can Liverpool keep hold of 'the greatest Egyptian player'?\nAfter Egypt's elimination, Salah threatened to quit the national team, but the country hopes he leads the team to victory on home soil at this summer's Africa Cup of Nations, which Egypt is set to host.\nHe has returned to form this season after a slow start and has scored 13 goals in the Premier League, one fewer than Aubameyang, as Liverpool bids to win its first league title in 29 years.\nAt the awards ceremony Tuesday night, South African striker Thembi Kgatlana was named women's player of the year. \nKgatlana, 22, was the breakout star of last year's Africa Women's Cup of Nations. She led South Africa to the final with five goals before losing to perennial champions Nigeria 1-0.\nNigerian Asisat Oshoala, winner of the award in the last two years, and Nigerian Francisca Ordega completed the top three in the women's category."}