{"title":"Roger Federer's tears for former coach: 'Never broke down like this'","author":"Exclusive: By Ravi Ubha and Christina Macfarlane, CNN","content":"Federer has spoken throughout his career about his influential former coach, who died in a car accident aged 37 in 2002 while honeymooning in South Africa.\nBut as Federer himself put it, he has rarely if ever \"broke down\" in an interview the way he did when talking to CNN's Christina Macfarlane from his training base in Dubai last month. \nREAD: Nadal lived tragedy of floods\nREAD: Meet tennis' record unluckiest loser\nFederer turned 37 last August 8, a day before what would have been Carter's 53rd birthday. \nWhen asked what Carter would think about his record men's haul of 20 grand slams, Federer teared up. \n\"Sorry,\" said Federer. \"Oh, man, I still miss him so much. I hope he would be proud. \n\"Geez, never broke down like this,\" he said later. \nFederer learned of Carter's death while competing at the Canadian Masters in Toronto and according to 'The Roger Federer Story: Quest for Perfection,' the book penned by Swiss tennis journalist Rene Stauffer, \"he was never so upset in his life.\"\nFederer \"left his hotel and ran through the streets, bawling and hysterical,\" the Australian newspaper reported. \nVisit CNN/com/sport for more news, features and videos\nWore black armband\nAlready eliminated in singles, Stauffer noted that Federer wore a black armband when he played and lost in the doubles in Toronto alongside Wayne Ferreira -- a South African -- against Australian duo Joshua Eagle and Sandon Stolle. \n\"I guess he didn't want me to be a wasted talent so I guess it was somewhat of a wake-up call for me when he passed away and I really started to train hard,\" Federer, temperamental prior to his grand slam winning days, continued to CNN Sport.  \n\"Peter was really a really important person in my life because I think if I can say thank you for my technique today, it's to Peter,\" he said. \nFederer says thank you in other ways, too. Every year since 2005, according to the Australian newspaper, he has invited Carter's Adelaide-based parents to watch him at the Australian Open in Melbourne, paying all their expenses. \nOn court the tennis world has seen tears from Federer before, both in victory and defeat. He was overcome with emotion for example when opening his grand slam account at Wimbledon in 2003, a triumph he dedicated to Carter. \nIn 2009 in Melbourne -- about seven months after losing what many consider the greatest match of all time against Rafael Nadal at Wimbledon -- the Spaniard famously put his arm around an inconsolable Federer during the trophy presentation after he had prevailed in another five-set thriller. \nREAD: Federer's kids catching tennis bug\n'Happy cry'\nThe Federer household, which includes wife Mirka and their two set of twins, has coined the term \"happy cry.\"\n\"I do get emotional watching movies sometimes but I did not know I had this happy cry as we call it in our family, not just when you are winning, but the kiddies,\" the Basel native said.\n\"Say (we had) a wonderful vacation, and we leave the place and the kids don't want to leave because they've had such a wonderful time in Australia. \n\"We call it a happy cry. I didn't know I had that in me\n\"When it first happened, I believe it was in the Davis Cup in Basel when I played an amazing weekend against the Americans (in 2001) and of course when I won Wimbledon, the emotions were so, so strong. \n\"You get asked the question, so how do you feel? And you are like, 'How I feel right now? This is how I feel like' and it's just like a complete meltdown.\n\"I never thought I was going to hold a trophy, I never thought I was going to win Wimbledon, I never thought I could stand here, standing ovation, trophy ceremony is completely surreal.\" \nAdded Federer: \"And when you start thinking of your family or your friends, you go back in the gym, you go back into the practice courts where there was nobody watching, and all of the sudden you realize we've put in so much work and it all paid off. \n\"It's hard to just say 'Yeah, no big deal.' It is a big deal for me because I really don't take it for granted, this career.\""}