{"title":"World's most beautiful race courses: From beaches to frozen lakes","author":"By Bianca Britton, CNN","content":"From the grounds of a 16th-century chateau, to beaches, snow-covered lakes, glorious greensward and a track squeezed among skyscrapers, the sport of kings offers some spectacular venues for racegoers to savor.\nHere is a look at some of the most beautiful horse racing locations in the world.\nVisit cnn.com/sport for more news, features and videos\nMeydan, Dubai\nBoasting the world's first five-star trackside hotel, restaurants and a museum, Dubai's Meydan Racecourse is a cathedral to 21st-century racing.  \nThe grandstand alone is more than a mile long and can host 60,000 spectators. What's more, there is a rooftop infinity pool.\nSince it replaced the Nad Al Sheba racecourse in 2010, Meydan has been home to one of the richest horse races in the world -- the Grade 1 Dubai World Cup.\nRecently the prize fund was boosted to $12 million and the 2019 winner will take home an eye-watering $7.2 million.\nREAD: Dubai ruler finally wins Melbourne Cup\nSt. Moritz, Switzerland\nThe upmarket ski resort is known for world-class winter sports, glitz, glamor and ... horse racing? \nThe venue for the White Turf event, which is held three days a year, isn't your typical racecourse. Horses and jockeys compete on a frozen lake against the wintery backdrop of the Engadine mountains. \nIt's no wonder the event attracts more than 35,000 spectators each year, drawn in by the gallop and trotting races, as well as fan-favorite skijöring, where skiers are pulled behind unsaddled horses around a 2,700-meter icy track. \nVisit CNN.com/Sport for more news, features and videos\nFlemington Racecourse, Australia\nHome to the famous Melbourne Cup, Flemington is the oldest metropolitan racecourse in Australia.\nIt was first used in 1840 when the town of Melbourne was just five years old. \nThe revamped venue bursts into a kaleidoscope of color and energy during the Melbourne Cup meeting. The historic race -- dubbed the \"race that stops a nation\" -- is a cultural and sporting icon, not just in Australia but around the world. \nThe Melbourne Cup had long been the richest race in Australia before being overtaken by The Everest. The prize pot still sits at about $5.3 million with 2018's winner collecting $2.8 million.\nPiazza del Campo, Italy\nSimply put, there is no racecourse in the world quite like the Piazza del Campo in Italy. The Palio di Siena horse race, which is held twice every year in July and August, dates back to medieval times when its first events were held on buffalo. \nThe course -- which is held in the central piazza of Siena -- is lined with spectators on all four sides and in the center with racing taking place on the ring formed around it.\nThe race has been dubbed by some as \"the toughest horse race in the world\" with jockeys, who wear the respective colors of their districts, riding bareback.\nREAD: Is this racing's most unique horse?\nHappy Valley, Hong Kong\nNestled amongst the skyscrapers in Hong Kong is Happy Valley Racecourse, which was originally constructed in 1845 to provide racing entertainment for British expats in the city.\nIt's a magnificent city center racecourse surrounded by giant apartments and skyscrapers -- giving visitors an unusually beautiful scenic view while watching horse racing.\nHappy Valley's seven-storey stands are regularly packed out with local fans and tourists alike, and can accommodate up to 55,000 spectators.\nWith a beer garden, live music and entertainment between races, the racecourse has become a regular after-work gathering place -- especially for what they call \"Happy Wednesday.\"\nREAD: Is this the hardest horse race in the world?\nAscot, England\nThe name \"Ascot\" conjures visions of royalty, elegance, high fashion and world-class racing. \nThe racecourse was opened in 1711 by Queen Anne and is one of the most celebrated venues on the horse racing calendar.\nRoyal Ascot is the highlight, with Queen Elizabeth II and other members of the British royal family in attendance alongside more than 300,000 racegoers over five days. \nWith £5.5 million in prize money, it's also the most valuable race meeting in Britain, but Ascot hosts a wealth of other world-class race days including the prestigious King George VI and Queen Elizabeth Stakes in July. \nThe racecourse features two tracks -- flat and jumps -- on a greensward about six miles from Windsor Castle.\nIn fact, it's technically still property of the British royal family, however Parliament passed a special act in 1813 to ensure that the course remain public.\nREAD: Why champion sire Frankel is 'rock 'n' roll' \nChantilly, France\nSpectacular and timeless, Chantilly racecourse nestles in front of the fairytale 16th-century Chateau de Chantilly amid a tree-lined tract 30 miles north of Paris.\nThe track, which was created in 1832, also abuts the majestic Great Stables (Les Grandes Écuries), which were built in 1719 by estate owner, Louis Henri Duc de Bourbon, Prince of Condé. \nIn 2016 and 2017, Chantilly played host to the Prix de l'Arc de Triomphe, Europe's most valuable horse race, while its traditional Longchamp home underwent a €130 million ($145 million) revamp.\nChantilly is home to the Prix du Jockey-Club and the Prix de Diane Longines, a celebration of equine excellence and French fashion elegance.\nREAD: The equine superstars giving Federer and Messi a run for their money \nLaytown Races, Ireland\nFor just a few hours every year, a stretch of sand on the Irish coast transforms into perhaps the most unique event on the horse racing calendar. \nLaytown Races -- situated near the country's capital Dublin -- is the only official beach race in Europe.\nThe 150-year-old tradition attracts more than 5,000 visitors every year, with spectators lining the makeshift grandstand etched into the overlooking sand dune. \nOrganizers race against time to set up the spectacle, battling against the tide to build the track and enclosures on the sand.\nREAD: 150 years of horse racing on the beach \nGoodwood, England \nGoodwood is the epitome of Englishness, boasting one of the most beautiful venues in the sport. \nThe rolling Sussex countryside unfolds in front of the glistening white grandstand which plays host to some of the most prestigious Flat races in Europe.\nThe highlight is the iconic Glorious Goodwood meeting, a racing festival which is one of the jewels in the crown of the British calendar, combining Grade 1 races with high fashion. \nThe track's undulating course offers a severe test to the runners and riders who have been visiting this picturesque corner of England since 1802. \nCheltenham, England\nNational Hunt racing may not always offer the glitz and glamor of Flat racing but Cheltenham is certainly the exception. \nAs well as offering the most prestigious jump meeting in the world, it also offers one of the most stunning settings in which to watch the sport. \nThe Cheltenham Festival every March is like a jamboree for jumps fans from Ireland and Britain, set against the backdrop of the idyllic Cotswold Hills.\nREAD: Why horses can't see orange\nOwners, jockeys and trainers from all over the world clamor for a win at the famous meeting-- with the prestigious Gold Cup the ultimate honor. "}