{"title":"For Orthodox churches in Ukraine and Russia, a politically charged Christmas","author":"Analysis by Nathan Hodge, CNN","content":"This Christmas, however, is a politically charged one for both Russia and Ukraine. On Saturday January 5, Ecumenical Patriarch Bartholomew of Constantinople signed a decree called a \"tomos\" that granted independence to the Orthodox Church in Ukraine.\nThe decree furthers a push begun in October to recognize the establishment of an independent Orthodox Church in the country. And it has given Ukrainian President Petro Poroshenko an important symbolic victory ahead of a presidential vote slated for the end of March. \nPoroshenko is facing an uphill battle to secure re-election, but he has been able to place himself front and center in Ukraine's bid for greater spiritual independence. In a series of statements on Twitter, Poroshenko said this January 7 would mark a first Christmas for the Autocephalous Orthodox Church of Ukraine with Metropolitan Epifaniy as its head.   \n\"We are celebrating the bright day of the Nativity of Christ in the Autocephalous Orthodox Church of Ukraine for the first time!\" Poroshenko said. \"For the first time, her Primate, His Beatitude Epifaniy, stood together yesterday with the Ecumenical Patriarch Bartholomew and received the tomos from his hands as a sign of recognition of the independence of our Ukrainian Church.\"\nThe Ukrainian president also posted a photo celebrating the arrival of the tomos in Ukraine, along with Christmas Eve photos of his family. \n \nThe establishment of the autocephalous (independent) church, however, puts Poroshenko on a collision course with the Kremlin. The tomos follows an announcement last October by Bartholomew that revoked an agreement dating back to 1686 that granted the Patriarch in Moscow authority over churches in Ukraine.\n \nThat move stoked major tensions between Moscow and Kiev: Russian President Vladimir Putin called a meeting of his Security Council on the matter, and the Russian Orthodox Church broke ties with the Ecumenical Patriarch of Constantinople. \nObservers say real-life conflicts could emerge over church property and who owns what in Ukraine. In his annual press conference in late December, Putin warned of \"bloodshed,\" saying the potential redistribution of church property could turn violent.\n\"I am mostly concerned about the likelihood that property redistribution will follow,\" Putin said. \"This is already happening. This redistribution could turn into a heavy dispute, if not bloodshed, God forbid.\"\nLet's not forget, however, that there is already real bloodshed in Ukraine, where separatists backed by Moscow in Ukraine's east have been locked in armed conflict with the central government in Kiev for nearly four years. \nThat conflict has claimed more than 10,000 lives to date, and shows little sign of de-escalating. In late November, Russian boats opened fire on and seized three Ukrainian ships near Crimea, prompting Ukraine to introduce martial law in some regions. \nThose emergency measures were lifted, but Russia's state-controlled television continues to have a field day portraying Poroshenko as deliberately stoking confrontation between Russia and Ukraine over autocephaly for the Ukrainian church.\nThe Orthodox Christmas Eve broadcast of Vesti, the evening news program on Russia's state-run Rossiya-1, reported on the tomos in typically heavy-handed fashion, calling Ukrainians \"schismatics\" and lampooning Poroshenko for swigging bottled water during the ceremony. \nBut the message from the Kremlin on Orthodox Christmas Day wasn't overtly political. It posted photos of Putin visiting a children's hospice on Christmas Eve and attending a service at the Transfiguration Cathedral in his home town, St. Petersburg."}