{"title":"As Brexit deadline looms, protests turn nasty outside UK Parliament","author":"By Nina Dos Santos and Sheena McKenzie, CNN ","content":"Recently, however, the scene has turned uglier. As the deadline for Britain's departure from the European Union nears, an increasingly vocal group with far-right links has joined the throng, harassing politicians and journalists, and hurling vicious insults.\nAnna Soubry, a Conservative Member of Parliament and -- unusually for her party  -- a supporter of a second referendum, was at the receiving end of abuse from this group on Monday. As she took part in TV interviews on College Green -- a patch of grass where TV crews and journalists mingle -- she was called everything from a \"liar\" to a \"Nazi.\"\nAs Soubry walked back towards the House of Commons after the TV interviews, she was surrounded by protesters who called her a \"fascist,\" in footage widely shared online. \nThe Soubry incident prompted howls of outrage from lawmakers, and has forced police to act. Deputy Assistant Commissioner Laurence Taylor of London's Metropolitan Police on Tuesday said officers at Westminster have been told to \"intervene appropriately\" where they \"hear or see breaches of the law.\" \nHe added that police were assessing whether any crimes had been committed in Monday's confrontation. So far, no one had been arrested.\nBut politicians have criticized the \"ongoing lack of coordination\" from police in the face of  \"deteriorating public order and security situation\" in and around Parliament.\nIn a letter to London's Metropolitan Police Commissioner Cressida Dick signed by 60 MPs, they said \"an ugly element of individuals with strong far right and extreme right connections -- which your officers are well aware of -- have increasingly engaged in intimidatory and potentially criminal acts\" against politicians, journalists, activists and the public.\"\nThe House of Commons Speaker, John Bercow, added his own letter to the Met on Tuesday, saying there was a \"regular coterie of burly white men who are effectively targeting and denouncing Members whom they recognize and dislike -- most notably female and those from ethnic minority backgrounds.\"\nMisogyny at play \nIt's not the first time Soubry has come under attack. A video posted on YouTube last month shows a group describing themselves as \"yellow vests\" -- and wearing the vests associated with the French activists of the same name -- following Soubry outside Parliament, calling her a \"traitor\" and likening her to Hitler. \nOne of the MPs who signed the letter to Scotland Yard, Labour member Pat McFadden, told CNN that the incident with Soubry on Monday was an \"ugly scene\" that revealed \"how divided the country is.\"\nHe added that \"it does appear that women broadcasters and MPs are receiving the harshest treatement -- so there is a misogynist element there.\"\nA well-known presenter for Britain's Sky News, Kay Burley, has often been at the receiving end of abuse as she has carried out interviews on College Green. Faisal Islam, political editor of Sky News, has been the subject of racist insults.  \nBurley revealed she is accompanied by security when she broadcasts from College Green.\n\"These people are not pro-Brexit. They are pro-intimidation,\" Burley tweeted Monday. \"They specifically target me and scream 'slag' or 'f****** fascist' over and over and over again.\" \nRemain campaigner and regular face outside Parliament, Steve Bray -- known as \"Stop Brexit Steve\" after his distinctive blue hat with the words \"Stop Brexit\" -- told CNN he has also been frequently targeted by the \"far-right extremists.\"\n\"We've been called Nazis, I've been jostled,\" he said. \"I can't repeat the nasty things they say, but it's been close to assault a few times.\"\nBray said the group was a separate entity to the regular group of Leave campaigners gathered outside Westminster, with whom he maintained a friendly relationship, despite not sharing their political views.\nStamping their feet to keep warm in the winter chill, the opposing groups -- each waving European Union flags or Britain's Union Jack-- even stopped to lightheartedly tease each other over the quality of their placards.\nHarry Todd, organizer of the Leave Means Leave campaign, told CNN that the group of pro-Brexit extremists could potentially taint his organization in the eyes of the public. \n\"I don't think it helps us,\" he said, while behind him a white double-decker bus with the words \"Stop the Brexit Betrayal\" emblazoned on its side drives past on its endless campaign loop around Westminster.\n\"I condemn in the strongest terms what they did (to Soubry), Todd said. But he added that there was a \"simmering anger\" in the country at the lack of action over Brexit that the government could no longer ignore.\nWith a week until Parliament votes on Prime Minister Theresa May's controversial Brexit deal, emotions at Westminster have reached fever pitch. "}