{"title":"The legend is building for Clemson QB Trevor Lawrence","author":"By Jill Martin, CNN","content":"On Monday night, Lawrence accomplished something Manning never did. He won the national title, blowing out Alabama 44-16 at the College Football Playoff national championship game in Santa Clara, California.\nWith the win Monday, Clemson became the first major college football team in the modern era to go 15-0. No major college football team had done that since the 19th century, when the University of Pennsylvania Quakers posted a 15-0 mark in 1897.\nNamed the offensive MVP, Lawrence completed 20 of 32 passing attempts for 347 yards and three touchdowns.\nSeeing it all play out on the sideline was Clemson legend Deshaun Watson. Now the Houston Texans starting quarterback, Watson had led Clemson to the national championship in 2016.\n\"He's gonna be a legend,\" Watson said of Lawrence, according to ESPN. \"He already is. People know that now.\"\nLawrence is the second true freshman -- playing in his first year immediately out of high school -- to win a national championship as a starting quarterback, joining Oklahoma's Jamelle Holieway (1985).\n\"That doesn't mean as much as being able to be a part of this team,\" Lawrence said. \"Really it's true, even if we didn't go all this way and win a national championship, this has been a team that I'll never forget for one, and it's just been amazing, the focus and how driven this team is has been unbelievable.\n\"Just these seniors, just taking me in, and they kind of dragged me along until I got my feet under me ... they're awesome people as well as players.\"\nVisit cnn.com/sport for more news, features and videos\nCollege football fans have at least two more years of Lawrence, and it's two years for NFL scouts, teams and fans to swoon over him.\n\"Trevor has always been a special talent in my mind, and it doesn't surprise me,\" Alabama head coach Nick Saban, who has been watching Lawrence play since his sophomore year of high school, said. \"He's got the right stuff as a person, and he's played phenomenally well for his team this year.\"\nSaid CNN's Coy Wire: \"I think Trevor Lawrence could play in the NFL right now.\"\nLawrence was born in Knoxville, Tennessee in 1999, just a couple of years after Manning played college football there for the Tennessee Volunteers from 1994-1997.\nHis parents were Tennessee fans, which rubbed off on Lawrence. He wears the jersey No. 16, which is a nod to Manning, who wore the number in college. \nLawrence started playing football when he was six years old, and the buzz about his potential started in middle school.\nBy the time he was in high school in Cartersville, Georgia, Lawrence already looked like he would one day be playing on Sundays. After his freshman season, the recruiting frenzy by college coaches was in full swing. He committed to Clemson and graduated from high school early, enrolling at the university in January 2018.\nHe started this season as Clemson's backup, behind incumbent starter Kelly Bryant. However, head coach Dabo Swinney couldn't keep Lawrence on the sideline any longer, making him the starter in the team's fifth game of the season, against Syracuse. Bryant has since left the team, announcing last month he was transferring to Missouri.\n\"Well, I mean, (Lawrence) was the best player, and that's not a knock to dis Kelly Bryant -- and I love Kelly Bryant, what a great player he is,\" Swinney said.\n\"But my job is to make decisions that put the team in the best possible path to win, and after four games he was the best player.\"\nA year ago, Lawrence was watching the national championship game and dreamed of playing in it. On Monday, the experience more than lived up to his expectations.\n\"I mean, it was just surreal,\" he said. \"So yeah, it was even better. It's always great just to get another game with this group of guys. Like I said, just been an amazing year.\"\nThe Trevor Lawrence hype is real, and the legend is sure to grow from here."}